app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ?  [["email", "administrator@adm.com"], ["password", "change_your_passwd"]]
---
	def sign_in
		email = params[:user][:email]
		password = params[:user][:password]

		user = User.where(email: email, password: password)[0]