app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE (login = NULL and password = 'teste')
---
	def sign_in
		login = params[:user][:login]
		password = params[:user][:password]

		user = User.where("login = ? and password = ?", login, password)[0]